<a href="https://colab.research.google.com/github/alishawalunj/googleCollab/blob/pythonBasics/Employees/Employees.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

**Importing Dataframe**

In [3]:
df = pd.read_csv("/content/drive/MyDrive/Datasets/Employee.csv")

**Display/Read the dataframe**

In [4]:
print(df.head())

   Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0  Bachelors         2017  Bangalore            3   34    Male          No
1  Bachelors         2013       Pune            1   28  Female          No
2  Bachelors         2014  New Delhi            3   38  Female          No
3    Masters         2016  Bangalore            3   27    Male          No
4    Masters         2017       Pune            3   24    Male         Yes

   ExperienceInCurrentDomain  LeaveOrNot
0                          0           0
1                          3           1
2                          2           0
3                          5           1
4                          2           1

In [7]:
print("Printing top 5 rows in data frame \n")
print(df.head(5))
print("\nPrinting top 10 rows in data frame \n")
print(df.head(10))

Printing top 5 rows in data frame

   Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0  Bachelors         2017  Bangalore            3   34    Male          No
1  Bachelors         2013       Pune            1   28  Female          No
2  Bachelors         2014  New Delhi            3   38  Female          No
3    Masters         2016  Bangalore            3   27    Male          No
4    Masters         2017       Pune            3   24    Male         Yes

   ExperienceInCurrentDomain  LeaveOrNot
0                          0           0
1                          3           1
2                          2           0
3                          5           1
4                          2           1

Printing top 10 rows in data frame

   Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0  Bachelors         2017  Bangalore            3   34    Male          No
1  Bachelors         2013       Pune            1   28  Female          No
2  Bachelors         2014  New Delhi            3   38  Female          No
3    Masters         2016  Bangalore            3   27    Male          No
4    Masters         2017       Pune            3   24    Male         Yes
5  Bachelors         2016  Bangalore            3   22    Male          No
6  Bachelors         2015  New Delhi            3   38    Male          No
7  Bachelors         2016  Bangalore            3   34  Female          No
8  Bachelors         2016       Pune            3   23    Male          No
9    Masters         2017  New Delhi            2   37    Male          No

   ExperienceInCurrentDomain  LeaveOrNot
0                          0           0
1                          3           1
2                          2           0
3                          5           1
4                          2           1
5                          0           0
6                          0           0
7                          2           1
8                          1           0
9                          2           0

In [8]:
print(df.tail())

      Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
4648  Bachelors         2013  Bangalore            3   26  Female          No
4649    Masters         2013       Pune            2   37    Male          No
4650    Masters         2018  New Delhi            3   27    Male          No
4651  Bachelors         2012  Bangalore            3   30    Male         Yes
4652  Bachelors         2015  Bangalore            3   33    Male         Yes

      ExperienceInCurrentDomain  LeaveOrNot
4648                          4           0
4649                          2           1
4650                          5           1
4651                          2           0
4652                          4           0

In [9]:
print("Printing bottom 5 rows in dataframe\n")
print(df.tail(5))
print("\nPrinting bottom 10 rows in dataframe\n")
print(df.tail(10))

Printing bottom 5 rows in dataframe

      Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
4648  Bachelors         2013  Bangalore            3   26  Female          No
4649    Masters         2013       Pune            2   37    Male          No
4650    Masters         2018  New Delhi            3   27    Male          No
4651  Bachelors         2012  Bangalore            3   30    Male         Yes
4652  Bachelors         2015  Bangalore            3   33    Male         Yes

      ExperienceInCurrentDomain  LeaveOrNot
4648                          4           0
4649                          2           1
4650                          5           1
4651                          2           0
4652                          4           0

Printing bottom 10 rows in dataframe

      Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
4643  Bachelors         2013  Bangalore            3   31  Female          No
4644  Bachelors         2015       Pune            3   32  Female         Yes
4645    Masters         2017       Pune            2   31  Female          No
4646  Bachelors         2013  Bangalore            3   25  Female          No
4647  Bachelors         2016       Pune            3   30    Male          No
4648  Bachelors         2013  Bangalore            3   26  Female          No
4649    Masters         2013       Pune            2   37    Male          No
4650    Masters         2018  New Delhi            3   27    Male          No
4651  Bachelors         2012  Bangalore            3   30    Male         Yes
4652  Bachelors         2015  Bangalore            3   33    Male         Yes

      ExperienceInCurrentDomain  LeaveOrNot
4643                          5           0
4644                          1           1
4645                          2           0
4646                          3           0
4647                          2           0
4648                          4           0
4649                          2           1
4650                          5           1
4651                          2           0
4652                          4           0

In [10]:
print("Printing Data frame information")
print(df.info())

Printing Data frame information
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   City                       4653 non-null   object
 3   PaymentTier                4653 non-null   int64
 4   Age                        4653 non-null   int64
 5   Gender                     4653 non-null   object
 6   EverBenched                4653 non-null   object
 7   ExperienceInCurrentDomain  4653 non-null   int64
 8   LeaveOrNot                 4653 non-null   int64
dtypes: int64(5), object(4)
memory usage: 327.3+ KB
None

In [12]:
# Printing descriptive statistics of all columns present in dataframe with numerical values
print(df.describe())

       JoiningYear  PaymentTier          Age  ExperienceInCurrentDomain  \
count  4653.000000  4653.000000  4653.000000                4653.000000
mean   2015.062970     2.698259    29.393295                   2.905652
std       1.863377     0.561435     4.826087                   1.558240
min    2012.000000     1.000000    22.000000                   0.000000
25%    2013.000000     3.000000    26.000000                   2.000000
50%    2015.000000     3.000000    28.000000                   3.000000
75%    2017.000000     3.000000    32.000000                   4.000000
max    2018.000000     3.000000    41.000000                   7.000000

        LeaveOrNot
count  4653.000000
mean      0.343864
std       0.475047
min       0.000000
25%       0.000000
50%       0.000000
75%       1.000000
max       1.000000

**Removing Columns from Pandas Dataframe**

In [16]:
# Deleting a column in dataframe

# Creating dataframe copy in order to preserve the original dataframe
df1 = df.copy()

# Deleting single column named 'City'
df1.drop('City', axis=1, inplace = True)

# Printing modified dataframe
print("Modified Dataframe after deletion of single column\n")
print(df1.info())

# Deleting multiple columns named 'Age' and 'Gender'
df1.drop(['Age', 'Gender'], axis=1, inplace = True)

# Printing modified dataframe
print("\nModified Dataframe after deletion of multiple columns\n")
print(df1.info())

Modified Dataframe after deletion of single column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 8 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   PaymentTier                4653 non-null   int64
 3   Age                        4653 non-null   int64
 4   Gender                     4653 non-null   object
 5   EverBenched                4653 non-null   object
 6   ExperienceInCurrentDomain  4653 non-null   int64
 7   LeaveOrNot                 4653 non-null   int64
dtypes: int64(5), object(3)
memory usage: 290.9+ KB
None

Modified Dataframe after deletion of multiple columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 6 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   PaymentTier                4653 non-null   int64
 3   EverBenched                4653 non-null   object
 4   ExperienceInCurrentDomain  4653 non-null   int64
 5   LeaveOrNot                 4653 non-null   int64
dtypes: int64(4), object(2)
memory usage: 218.2+ KB
None